# ClientApi

| Method  | Description |
|--------|-------------|
| **ConnectClientAsync** | Connects a client to the ConnectionRestApi service and returns a unique identifier for the client. |
| **GetVersionAsync** | Gets the IdeaStatica API assembly version. |

<a id="connectclient"></a>
## **ConnectClientAsync**
> **string ConnectClientAsync ()**

Connects a client to the ConnectionRestApi service and returns a unique identifier for the client.

### Parameters
This endpoint does not need any parameter.
### Return type

**string**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.ConnectionApi.Api;
using IdeaStatiCa.ConnectionApi.Client;
using IdeaStatiCa.ConnectionApi.Model;

namespace Example
{
    public class ConnectClientAsyncExample
    {
        public static async Task Main()
        {
            string ideaConFile = "testCon.ideaCon";

            string ideaStatiCaPath = "C:\\Program Files\\IDEA StatiCa\\StatiCa 26.0"; // Path to the IdeaStatiCa.ConnectionRestApi.exe

            using (var clientFactory = new ConnectionApiServiceRunner(ideaStatiCaPath))
            {
                using (var conClient = await clientFactory.CreateApiClient())
                {

                    // (Required) Select parameters

                    try
                    {
                        // Connects a client to the ConnectionRestApi service and returns a unique identifier for the client.
                        string result = await conClient.Client.ConnectClientAsync();
                        Debug.WriteLine(result);
                    }
                    catch (ApiException  e)
                    {
                        Console.WriteLine("Exception when calling Client.ConnectClientAsync: " + e.Message);
                        Console.WriteLine("Status Code: " + e.ErrorCode);
                        Console.WriteLine(e.StackTrace);
                    }
                    finally
                    {
                    }
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/clients/connect-client

#### Using the ConnectClientWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Connects a client to the ConnectionRestApi service and returns a unique identifier for the client.
    ApiResponse<string> response = conClient.Client.ConnectClientWithHttpInfo();
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling ClientApi.ConnectClientWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: text/plain

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |
| **500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="getversion"></a>
## **GetVersionAsync**
> **string GetVersionAsync ()**

Gets the IdeaStatica API assembly version.

### Parameters
This endpoint does not need any parameter.
### Return type

**string**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.ConnectionApi.Api;
using IdeaStatiCa.ConnectionApi.Client;
using IdeaStatiCa.ConnectionApi.Model;

namespace Example
{
    public class GetVersionAsyncExample
    {
        public static async Task Main()
        {
            string ideaConFile = "testCon.ideaCon";

            string ideaStatiCaPath = "C:\\Program Files\\IDEA StatiCa\\StatiCa 26.0"; // Path to the IdeaStatiCa.ConnectionRestApi.exe

            using (var clientFactory = new ConnectionApiServiceRunner(ideaStatiCaPath))
            {
                using (var conClient = await clientFactory.CreateApiClient())
                {

                    // (Required) Select parameters

                    try
                    {
                        // Gets the IdeaStatica API assembly version.
                        string result = await conClient.Client.GetVersionAsync();
                        Debug.WriteLine(result);
                    }
                    catch (ApiException  e)
                    {
                        Console.WriteLine("Exception when calling Client.GetVersionAsync: " + e.Message);
                        Console.WriteLine("Status Code: " + e.ErrorCode);
                        Console.WriteLine(e.StackTrace);
                    }
                    finally
                    {
                    }
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/clients/idea-service-version

#### Using the GetVersionWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Gets the IdeaStatica API assembly version.
    ApiResponse<string> response = conClient.Client.GetVersionWithHttpInfo();
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling ClientApi.GetVersionWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | OK |  -  |
| **500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)